{"pageProps":{"contentData":{"topic":"valgrind","page":"0-Introduction.md","contentHtml":"<h1>Valgrind - Introduction</h1>\n<p>Valgrind is a framework for building dynamic analysis tools. It comes with a set of tools each of which performs some kind of debugging, profiling or similar task that helps you improve your programs.</p>\n<p>A number of tools are supplied as standard; we will go over two of them as they will likely the most important in your CS journey:</p>\n<ul>\n<li><strong>Memcheck</strong>, a memory error detector. It helps make programs, particularly those written in C and C++, more correct.</li>\n<li><strong>Massif</strong>, a heap profiler. It helps profiling the memory usage of programs, thus helping the programmer use less memory.</li>\n</ul>\n<p>In these Valgrind guides, we will use C for demonstration purposes.</p>\n<h3>Explanation</h3>\n<p>When using Valgrind, your program is run on a synthetic CPU provided by the Valgrind core. The selected tool will add its own instrumentation code to your program and hand the result back to the core.\nSince Valgrind simulates every single instruction a program executes, running it with these tools makes it a lot slower (i.e. 10-50 times slower with Memcheck, which adds code to check every memory access and value computed).</p>\n<h3>Installation</h3>\n<p>All major Linux distributions include Valgrind in their repositories.\nFor most Debian-based distributions (such as Debian, Ubuntu, Lubuntu, Xubuntu, Pop OS, Linux Mint, Kali Linux and Deepin), the <code>apt</code> package manager is the easiest way to install Valgrind. Just run the following command in your terminal:</p>\n<pre><code class=\"hljs language-bash\">sudo apt-get install valgrind\n</code></pre>\n<p>For Manjaro (the <code>-S</code> flag also installs dependencies for valgrind):</p>\n<pre><code class=\"hljs language-bash\">sudo pacman -S valgrind\n</code></pre>\n<p>For Mac, the following should work:</p>\n<pre><code class=\"hljs language-bash\">brew install valgrind\n</code></pre>\n<p>If the above command doesn't work for some reason, <a href=\"https://stackoverflow.com/questions/8102143/how-to-build-and-install-valgrind-on-mac\">this post</a> should contain all the information for your particular needs.</p>\n<h3>Usage:</h3>\n<p>You invoke Valgrind like this:\n<code>valgrind [valgrind-arguments] your-program [your-program-arguments]</code></p>\n<p>The most important Valgrind option is <code>--tool</code>, which dictates which of the tools to use.\nHowever, Memcheck is the default tool, so if you want to use it you can omit the <code>--tool</code> option.</p>"},"topicPages":[{"topic":"valgrind","page":"Introduction"},{"topic":"valgrind","page":"Basic Example"},{"topic":"valgrind","page":"Memory Leaks"}]},"__N_SSG":true}