{"pageProps":{"contentData":{"topic":"bash","page":"introduction","contentHtml":"<h1>Bash - Introduction</h1>\n<p>A command line is a text interface to your computer, you may find it on multiple occasions referred to as the shell, terminal, console, prompt. When looking for the first time it can look complex and confusing. Yet it is a fundamental tool the user to be more productive and even perform actions that the GUI don't offer.</p>\n<p>Bash is a POSIX-compliant shell that allows the user to perform a set of actions in his system. Bash is like all other Unix shells, and it supports filename globbing (wildcard matching), piping, here documents, command substitution, variables, and control structures for condition-testing and iteration. Bash is also command language, but that is a whole different topic.</p>\n<p>In this introduction we will touch in some basic topics that allow you to perform essential tasks like changing directory (folder), creating directories and manipulate files.</p>\n<h2>Basics</h2>\n<p>First thing first, we need to open a terminal, most Linux systems use the same default keyboard shortcut: Ctrl-Alt-T.</p>\n<p>Now that you have the terminal open we can start understanding what we are seeing.\nYou should have something like this:</p>\n<pre><code class=\"hljs language-bash\">username@computer:~ $</code></pre>\n<p>Before the \":\" we have the computer name and username. After the \":\" we have two symbols the \"~\" and \"$\". The \"~\" is your current directory (folder), the tilde is a special character that corresponds to your HOME directory, more about that soon. Finally, the \"$\" indicates the beginning of the prompt where you can write the commands</p>\n<h3>Print current directory</h3>\n<p>Let's write our first command. Write <code>pwd</code> and press ENTER.</p>\n<pre><code class=\"hljs language-bash\">~ $ <span class=\"hljs-built_in\">pwd</span>\n/home/YOUR_USERNAME</code></pre>\n<p>The pwd prints the name of current/working directory. This should comply with what is in your prompt. Although, as you might have seen you have ~ and not /home/YOUR_USERNAME, that's because they are the same thing. The ~ is a symbol for the user home directory which is /home/YOUR_USERNAME.</p>\n<h3>Understand a command</h3>\n<p>One very useful command is the \"man\" command which is the system's manual pager. This is very useful to understand what a program, utility or function can do. Whenever you want to know more about a certain command just write \"man THE_COMMAND\", for example:</p>\n<pre><code class=\"hljs language-bash\">~ $ man <span class=\"hljs-built_in\">pwd</span></code></pre>\n<p>The result will be a page with some information about the \"pwd\" and what it can do. To leave the page just press the key \"q\".</p>\n<h3>What a directory has inside</h3>\n<p>To list the content inside a directory we use the \"ls\" command. To use it we just need to write the directory path as an argument. But, when we just want to list the content inside the current directory we can omit the path and write just the command name ls, example: </p>\n<pre><code class=\"hljs language-bash\">~ $ ls\n~ $ ls /home</code></pre>\n<p>If we add the flag \"-a\" to the command, example:</p>\n<pre><code class=\"hljs language-bash\">~ $ ls -a</code></pre>\n<p>Know we can see files that start with \".\", and that usually are ignored. Including two special directories \".\" and \"..\", the \".\" corresponds always to the current directory, and the \"..\" is the parent of the current directory, i.e. if the current directory is \"/home/user\" then \"..\" is the \"/home\" directory.</p>\n<h3>Change directory</h3>\n<p>To change the current directory (folder) we use the \"cd\" command. To use it we pass as an argument the path of the directory we want to go. If we don't give any path it will go to the HOME directory. </p>\n<pre><code class=\"hljs language-bash\">~ $ <span class=\"hljs-built_in\">cd</span> /\n/ $ ls\n/ $ <span class=\"hljs-built_in\">cd</span> ~\n~ $</code></pre>\n<p>We can also use the special folder \".\" and \"..\", although the \".\" will not do anything:</p>\n<pre><code class=\"hljs language-bash\">~ $ <span class=\"hljs-built_in\">cd</span> .\n~ $ <span class=\"hljs-built_in\">cd</span> ..\n/home $</code></pre>\n<h3>Create Folders</h3>\n<p>To create a new directory (folder) we use the \"mkdir\" command. </p>\n<pre><code class=\"hljs language-bash\">~ $ mkdir /tmp/cs-essentials\n~ $ <span class=\"hljs-built_in\">cd</span> /tmp/cs-essentials\n/tmp/cs-essentials $</code></pre>\n<h3>Create File</h3>\n<p>To create a new file we can use a lot of commands. We will show only two ways of doing it. The first is redirecting the output of a command to a file. To know more about how this works you can read the IO Redirection page. </p>\n<pre><code class=\"hljs language-bash\">/tmp/cs-essentials $ <span class=\"hljs-built_in\">echo</span> <span class=\"hljs-string\">\"Hello\"</span> > file1.txt\n/tmp/cs-essentials $ ls > file2.txt</code></pre>\n<p>The echo command usually would display \"Hello\" on the terminal, and the ls would print the content inside the current directory. But, we indicated with the \">\" symbol that we wanted the result to be written at \"file1.txt\" and \"file2.txt\".</p>\n<p>Another way to create a file is by using the \"touch\" command. This command basically updates the access and modification times of each FILE to the current time. Although if the FILE argument does not exist it is created empty, example:</p>\n<pre><code class=\"hljs language-bash\">/tmp/cs-essentials $ touch file3.txt</code></pre>\n<h3>Read file</h3>\n<p>To read a file with the terminal we use the \"cat\" command. This command will concatenate all the files given as arguments and print them on the terminal.</p>\n<pre><code class=\"hljs language-bash\">/tmp/cs-essentials $ cat file1.txt</code></pre>\n<h3>Move file</h3>\n<p>To move a file from a directory to another we use the \"mv\" command. This command receives two arguments, the source file path and the destination file path, the path can be relative or absolute, example: </p>\n<pre><code class=\"hljs language-bash\">/tmp/cs-essentials $ mv file1.txt /tmp/file1.txt\n/tmp/cs-essentials $ <span class=\"hljs-built_in\">cd</span> /tmp\n/tmp $ ls\n/tmp $ cat file1.txt</code></pre>\n<h3>Rename file</h3>\n<p>To rename a file we also use the \"mv\" command.</p>\n<pre><code class=\"hljs language-bash\">/tmp $ mv file1.txt file111.txt\n/tmp $ ls\n/tmp $ cat file111.txt</code></pre>\n<h3>Delete file/directory</h3>\n<p>Before we introduce the \"rm\" command we would like to give a warning. Unlike GUI (graphical user interfaces), the \"rm\" command doesn't move files to a folder called \"Trash\". It will delete the files/directories completely from your system. Be very careful using this command. Always make sure that the parameters you use with \"rm\" command are correct. With some practice, it will become easier to use it but at the beginning, we recommend that you use the flag '-i' which will prompt you to confirm the action, example:</p>\n<pre><code class=\"hljs language-bash\">/tmp $ rm -i file1.txt</code></pre>\n<p>To delete a file we use the \"rm\" command. This command receives the path, absolute or relative, of the file we want to delete.</p>\n<pre><code class=\"hljs language-bash\">/tmp $ rm -i file1.txt</code></pre>\n<p>To delete a directory we need to add the flag \"-r\", which stands for <em>recursive</em>. With this flag, the \"rm\" command will remove directories and their contents recursively.</p>\n<pre><code class=\"hljs language-bash\">/tmp $ rm -ri cs-essentials</code></pre>\n"},"topicPages":[{"topic":"bash","page":"introduction"},{"topic":"bash","page":"commands"},{"topic":"bash","page":"customization"},{"topic":"bash","page":"ioRedirection"},{"topic":"bash","page":"permissions"},{"topic":"bash","page":"processManagement"},{"topic":"bash","page":"shortcuts"}]},"__N_SSG":true}